app/controllers/backlog_controller.rb

SELECT * FROM "projects" WHERE ("projects"."id" = 1)
---
  def index
      @view = :project
      @project = Project.find(params[:project_id])