app/controllers/projects_controller.rb

SELECT * FROM "projects" WHERE ("projects"."id" = 1)
SELECT * FROM "stories" WHERE (project_id = 1) ORDER BY importance DESC
---
  def show
    @project = Project.find(params[:id])
    @stories_by_priority = Story.find(:all, :conditions => "project_id = #{@project.id}", :order => "priority DESC")

INSERT INTO "projects" ("name", "updated_at", "created_at") VALUES('Agilar TaskBoard', '2009-02-18 00:12:26', '2009-02-18 00:12:26')
---
  def create
    @project = Project.new(params[:project])

    respond_to do |format|
      if @project.save

SELECT * FROM "projects" WHERE ("projects"."id" = 1)
UPDATE "projects" SET "name" = 'Agilar Taskboard', "updated_at" = '2009-02-18 00:19:32' WHERE "id" = 1
---
  def update
    @project = Project.find(params[:id])

    respond_to do |format|
      if @project.update_attributes(params[:project])

SELECT * FROM "tasks" WHERE ("tasks".story_id = 7)
UPDATE "tasks" SET "status" = 'undefined', "updated_at" = '2009-02-18 12:37:46' WHERE "id" = 4
---
  def update_task
    @task = Task.find(params[:task])
    old_status = @task.status
    @task.status = params[:status]
    @task.relative_position_x = params[:x]
    @task.relative_position_y = params[:y]
    if(@task.status == 'finished')
	@task.remove_tags
    end
    @task.save