app/controllers/stories_controller.rb

  def create
    @story = Story.new(params[:story])
    @project = Project.find(params[:project_id])
---
SELECT * FROM "projects" WHERE ("projects"."id" = 1)