app/controllers/stories_controller.rb

SELECT * FROM "stories" WHERE ("stories"."id" = 1)
---
  def show
    @story = Story.find(params[:id])

SELECT * FROM "projects" WHERE ("projects"."id" = 1)
SELECT * FROM "projects"
---
  def new
    @project = (params[:project]) ? params[:project] : nil
    @projects = (params[:project]) ? [Project.find(params[:project])] : Team.find(params[:team]).projects
    @story_ids = []
    @next_priorities = []
	  @story = (params[:project]) ? Story.new(:project_id => params[:project]) : Story.new(:project_id => @projects.first.id )

SELECT * FROM "stories" WHERE ("stories"."id" = 1)
---
  def edit
    @story = Story.find(params[:id])

INSERT INTO "stories" ("name", "project_id", "updated_at", "how_to_demo", "notes", "estimate", "importance", "created_at") VALUES('Design', NULL, '2009-02-18 00:31:47', 'Have a svg done to show.', '', 2, 100, '2009-02-18 00:31:47')
---
  def create
    @story = Story.new(params[:story])
    if @story.save

SELECT * FROM "stories" WHERE ("stories"."id" = 9)
UPDATE "stories" SET "how_to_demo" = 'Product Owner gets a new URL for the Taskboard application, and it is hosted in the Agilar production server.', "updated_at" = '2009-02-18 16:10:37' WHERE "id" = 10
---
  def update
    @story = Story.find(params[:id])
	  if @story.update_attributes(params[:story])

SELECT * FROM "stories" WHERE ("stories"."id" = 2)
DELETE FROM "stories" WHERE "id" = 2
---
  def destroy
    @story = Story.find(params[:id])
    if @story.destroy