app/controllers/tasks_controller.rb

  def show
    @task = Task.find(params[:id])
---
SELECT * FROM "tasks" WHERE ("tasks"."id" = 1)

  def new
    @task = Task.new
    # Check if a story has been sent as a parameter, if not put a list of stories
    if params[:story]
      @story = Story.find(params[:story])
---
SELECT * FROM "stories" WHERE ("stories"."id" = 7)

  def edit
    @task = Task.find(params[:id])
---
SELECT * FROM "tasks" WHERE ("tasks"."id" = 1)

  def create
    @task = Task.new(params[:task])
    @task.story = Story.find(params[:story_id])
    @task.status = params[:status]
    if params[:task][:description] == "Description"
      @task.description = ""
    end

    if @task.save
---
SELECT * FROM "stories" WHERE ("stories"."id" = 7)
INSERT INTO "tasks" ("name", "status", "updated_at", "story_id", "description", "created_at") VALUES('Install Passenger (mod_rails)', 'finished', '2009-02-19 12:05:06', 10, 'Install and configure mod_rails for apache.

  def update
    @task = Task.find(params[:id])

    if @task.update_attributes(params[:task])
---
SELECT * FROM "tasks" WHERE ("tasks"."id" = 1)
UPDATE "tasks" SET "name" = 'Finished', "status" = 'finished', "updated_at" = '2009-02-18 11:45:27' WHERE "id" = 7

  def destroy
    @task = Task.find(params[:id])
    @task.nametags.each {|nametag| nametag.destroy }
---
SELECT * FROM "tasks" WHERE ("tasks"."id" = 1)
DELETE FROM "tasks" WHERE "id" = 1